//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

/* int SecondNumber(int number)
{
    if(number > 99 && number < 1000)
    {
        number = (number / 10) % 10;
            
    }
    
        else
    {
        Console.WriteLine($"Number {number} is bad");
    }
    return number;

}

Console.WriteLine("Введите трехзначное число");
int num = Convert.ToInt32(Console.ReadLine());

int secondNum = SecondNumber(num);

Console.WriteLine($"Вторая цифра {num} = {secondNum}");  */



//Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

/* int ThirdNumber (int number)
{
    if (number < 100)
    {
        Console.WriteLine("третьей цифры нет");
    }
    else
    {       
        if(number > 999)
        {
            while(number > 999)
            {
                number /=10;
            }
            Console.WriteLine($"Третья цифра {number} = {number % 10}");
        }
        else
        {
            Console.WriteLine($"Третья цифра {number} = {number % 10}");
        }
        
    }
    return number;   
}

Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());

int thirdNum = ThirdNumber (num); */



//Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

int numberDay (int numberDay)
{
    
    if (numberDay >= 1 && numberDay <= 7)
    {
        Console.WriteLine("Введите число");
        if (numberDay >= 6)
        {
            Console.WriteLine("это выходной день");
        }
        else
        {
            Console.WriteLine("это будний день");
        }        
    }
    else
    {
        Console.WriteLine("Число должно быть от 1 до 7");
    }
    return numberDay;
}

int num = Convert.ToInt32(Console.ReadLine());

int dayNum = numberDay (num);
